app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM "projects"

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "start_date", "created_at", "estimated_finish_date", "creation_date", "updated_at", "estimated_start_date", "description", "end_date") VALUES(NULL, NULL, '2010-02-03 14:43:00', NULL, NULL, '2010-02-03 14:43:00', NULL, NULL, NULL)

  def update
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 980190962)

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 980190962)
DELETE FROM "projects" WHERE "id" = 980190962