app/controllers/tasks_controller.rb

  def index

      case params[:filter]
      when "all"
          @tasks = Task.all
---
SELECT * FROM "tasks"

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("start_date", "duration", "created_at", "title", "estimated_finish_date", "estimated_duration", "updated_at", "project", "estimated_start_date", "description", "finish_date", "owner") VALUES('2010-02-03', 1, '2010-02-03 12:17:41', 'taskflakes git repository 생성', '2010-03-31', 60, '2010-02-03 12:17:41', 'taskflakes', '2010-02-03', 'taskflakes 프로젝트의 git repository를 github에 생성하기.', '2010-03-31', '장정호')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "project" = 'taskflakes', "updated_at" = '2010-02-03 12:21:08', "estimated_duration" = 1, "start_date" = '2010-02-03', "title" = 'tasks controller 개발', "duration" = 1, "estimated_finish_date" = '2010-02-03', "estimated_start_date" = '2010-02-03', "owner" = '장정호', "finish_date" = '2010-02-03', "description" = 'task에 대한 CRUD를 수행할 수 있는 tasks controller와 기본적인 view 개발.' WHERE "id" = 1